<?php
use common\models\Subject;
use yii\helpers\Url;

/* @var $this \yii\web\View */
/* @var $subjects Subject */
/* @var $subject Subject */

$this->title = Yii::t('app', 'Материалы');
$this->params['breadcrumbs'][] = ['label' => $this->title, 'url' => ['article/index']];
$this->params['heroTitle'] = $this->title;
$this->params['heroDescription'] = 'БІЛІМ ШЫҢЫ - ҒЫЛЫМ СЫРЫ';
?>
<div class="container pt--60">
    <div>
        <div class="section-title text-center mb--60">
            <span class="subtitle bg-secondary-opacity">Портфолио</span>
            <h2 class="title">Мақалалар, материал жариялау</h2>
        </div>
        <?php if (Yii::$app->language === 'kz'): ?>
            <div>
                <p>
                    СӘЛЕМЕТСІЗ БЕ, ҚҰРМЕТТІ  ПЕДАГОГ!
                </p>
                <p>
                    Сіз «Білім шыңы-Ғылым сыры» журналының электронды сайтында 2 рет өз материалыңызды жариялап, портфолиоға 100 % жарамды QR кодталған Сертификат пен Грамотаны  небәрі 2 минутта жүктеп  алуыңызға болады.
                </p>
                <p>
                    Сертификат пен Грамотаны өз портфолиоңызға қоса аласыз және аттестаттау комиссиясының лайықты бағасын ала аласыз, осылайша біліктілік санатыңызды арттыра аласыз
                </p>
                <p>
                    «Білім шыңы-Ғылым сыры» журналы ҚР Инвестициялар және Даму Министрлігінің Байланыс, Ақпараттандыру және Ақпарат комитетіне тіркелген.
                    <br>
                    Тіркеу куәлігі №15454-Ж (01.07.2015)
                </p>
                <p>
                    Сайтта материал жариялау жарнасы - 3000 теңге. (2 материал  жариялауға рұқат беріледі. 2 рет Сертификат пен Гармота ала аласыз)
                </p>
            </div>
            <a id="toggleBtn" style="color: blue" href="#">Толығырақ</a>
            </p>
            <div id="toggleText" style="display: none">
                <p>
                    САЙТТА МАТЕРИАЛ ЖАРИЯЛАУ ТӘРТІБІ:
                </p>
                <p>
                    1. МАТЕРИАЛ ЖАРИЯЛАУ батырмасын басыңыз.
                </p>
                <p>
                    2. Анкетаны толық әрі қатесіз толтырыңыз.
                </p>
                <p>
                    3. Дайындаған материалыңызды жүктеңіз.
                </p>
                <p>
                    4. Төлем бетіне өтіңіз. (Материал жариялау жарнасы – 3000 тг.)
                </p>
                <p>
                    5. Сайтта отырып өзіңізде бар ТӨЛЕМ картамен төлей аласыз.
                </p>
                <p>
                    6. Төлем жасалған соң бірден материалыңызды сайтқа орналастырасыз. Сертификат пен Грамота шығады. Жүктеп аласыз. Егер жүктеп үлгермесеңіз немесе қайта жүктеу қажет болса, КӨМЕК бөлімінде сақталады.
                </p>
                <p>
                    7. Егер сайтта төлем жасау қиындық туғызса, 8775 076 78 76 Бахыткүл Е. КАСПИЙ ГОЛД номеріне жарнаны аударып, төлем чек пен ЖСН-ді вадсап номеріне жібересіз. Сіздің ЖСН-ңіз базаға тіркейміз. «Тіркелді» деген жауап алғаннан кейін https://bilimshini.kz/kz сілтемесімен сайтқа қайта кіріп, материал жүктеп, Сертификат пен Грамотаныы ала беруіңізге болады.
                </p>
                <p>
                    <b>СҰРАҚТАРЫҢЫЗ БОЛСА</b>
                    <br>Whatsapp номерлер:
                    <br><a href="https://wa.me/77786252078">https://wa.me/77786252078</a>
                    <br><a href="https://wa.me/77750767876">https://wa.me/77750767876</a>
                </p>
            </div>
        <?php else: ?>
            <p>
                В разделе "Публикация" - вы можете найти планы уроков, открытые уроки и учебные часы, и другие документы, необходимые учителям.
            </p>
            <p>
                <b>ЗДРАВСТВУЙ, УВАЖАЕМЫЙ ПЕДАГОГ!</b><br>
            <p>
                Вы можете получить Сертификат со 100% действительным для портфолио QR-кодом, опубликовав свой материал на сайте электронного журнала «Білім шыңы-Ғылым сыры»
            </p>
            <p>
                Ваш материал будет включен в базу данных ПУБЛИКАЦИИ МАТЕРИАЛОВ нашего сайта, что создаст площадку для практики учителей
            </p>
            <a id="toggleBtn" style="color: blue" href="#">Подробнее </a>
            </p>
            <div id="toggleText" style="display: none">
                <p><b>УСЛОВИЯ ПУБЛИКАЦИИ МАТЕРИАЛОВ:</b></p>
                <p>
                    1. Нажмите на кнопку ПУБЛИКАЦИЯ МАТЕРИАЛА.
                </p>
                <p>
                    2. Заполните анкету полностью и без ошибок.
                </p>
                <p>
                    3. Перейдите на страницу оплаты. (Взнос публикации материала – 3000 тг.)
                </p>
                <p>
                    4. Находясь на сайте, Вы можете произвести ОПЛАТУ любой платежной картой.
                </p>
                <p>
                    5. Сразу после оплаты Вы разместите свой материал на сайте. Выйдет сертификат. Скачайте. Вы можете опубликовать Ваш материал 3 раза по трем темам и получить СЕРТИФИКАТ и ГРАМОТО.
                </p>
                <p>
                    6. Если на сайте сложно произвести оплату, Вы можете произвести перевод на номер КАСПИЙ ГОЛД 8775 076 78 76 БАХЫТКҮЛ Е. и отправить чек об оплате и ИИН на wadsap номер. Вам предоставят доступ к публикации материалов.
                </p>
                <p>
                    По дополнительным вопросам на Whatsapp:
                    <br>
                    <br><a href="https://wa.me/77786252078">https://wa.me/77786252078</a>
                    <br>
                    <br><a href="https://wa.me/77083176516">https://wa.me/77083176516</a>
                </p>
            </div>
        <?php endif; ?>
        <a class="article-order-widget__link btn btn-success" href="<?= Url::to(['article/order']) ?>">
            <?= Yii::t('app', 'Опубликовать материал') ?>
        </a>
    </div>
    <div class="row" style="padding-top: 20px">
        <?php foreach ($subjects as $subject): ?>
            <div class="col-md-3">
                <a class="subject-list__item" style="background: linear-gradient(90deg, rgba(0,0,0,0.4) 10%, rgba(0,0,0,0.4) 40%), url('<?= '/img/' . $subject->img ?>')" href="<?= Url::to(['article/list', 'id' => $subject->id]) ?>">
                    <h5><?= $subject->getName() ?></h5>
                </a>
            </div>
        <?php endforeach; ?>
    </div>
</div>
<?php
$js =<<<JS
$('#toggleBtn').click(function() {
  $('#toggleText').toggle('ease');
});
JS;

$this->registerJs($js);
?>