<?php
use common\models\Subject;
use yii\helpers\Url;

/* @var $this \yii\web\View */
/* @var $subjects Subject */
/* @var $subject Subject */

$this->title = Yii::t('app', 'Материалы');
$this->params['breadcrumbs'][] = ['label' => $this->title, 'url' => ['article/index']];
$this->params['heroTitle'] = $this->title;
$this->params['heroDescription'] = 'БІЛІМ ШЫҢЫ - ҒЫЛЫМ СЫРЫ';
?>
<div>
    <?php if (Yii::$app->language === 'kz'): ?>
        <div>
            <p class="text-center">
                <b>«МҰҒАЛІМДЕР КҮНІ»</b> мерекесі, <br>
                <b>«ҰЛТ ҰСТАЗЫ АХМЕТ БАЙТҰРСЫНОВҚА 150 ЖЫЛ»</b> мерейтойына <br>
                орай білім саласының дамуына сүбелі үлес қосып жүрген <br>
                ұстаздарымызды дәріптеу, оларды алғысқа бөлеу мақсатында өтетін <br>
               <b> «ҚҰРМЕТТІ ҰСТАЗ» БАЙҚАУЫНА</b> <br>
               <b> ШАҚЫРАМЫЗ!!!</b>
            </p>
            <p>
                <b>БАЙҚАУДЫҢ МАҚСАТЫ:</b>
                <br>
                «Мұғалімдер күні» мерекесі, «Ұлт ұстазы Ахмет Байтұрсыновқа 150 жыл» мерейтойына орай қоғамда педагог кадрлардың теориялық білімі мен практикалық дағдыларын тереңдету, педагог мәртебесін арттыру, сапалы білімге қолжетімділікті арттыратын «ҚҰРМЕТТІ ҰСТАЗ»-ды анықтау, ең құнды материалдарды жинақтап, жақсы мұғалімдердің тәжірибе алаңын құру.
            </p>
            <p>
                <b>БАЙҚАУҒА ҚАТЫСУШЫЛАР:</b>
                <br>
                Байқауға республика көлеміндегі мектепке дейінгі, орта, арнайы мамандандырылған, қосымша, жалпы орта, техникалық және кәсіптік білім беру ұйымдарының педагогтері  қатыса алады.
                <br><b>БАЙҚАУҒА ҚАТЫСУ АҚЫЛЫ ЕМЕС!!!</b>
            </p>
        </div>
            <a id="toggleBtn" style="color: blue" href="#">Толығырақ</a>
        </p>
        <div id="toggleText" style="display: none">
            <p>
                <b>БАЙҚАУ ШАРТТАРЫ:</b> <br>
                1.	Байқауға қатысушының кемінде бес жыл педагогикалық жұмыс тәжірибесі болуы шарт.
                <br> 2.	Байқауға қатысушы педагог жаңартылған білім бағдарламасының әдіс-тәсілдерін қолданып өткізген ашық сабақтарының бірін немесе шығармашылық еңбегін bilim-shini.kz сайтында жариялауы қажет. Материал жариялағаннан кейін автоматты түрде QR-ы бар Сертификат беріледі, бірден жүктеп алыңыз, Сіздің портфолиоңызға аса қажет болады.
            </p>
            <p>
                <b>БАЙҚАУҒА ЖІБЕРЕТІН МАТЕРИАЛЫМДЫ САЙТТА  ҚАЛАЙ ЖАРИЯЛАЙМЫН?</b>
                <br>Ол үшін төмендегі шарттарды орындаңыз:
            </p>
            <ul>
                <li>bilim-shini.kz сілтемесін басыңыз.</li>
                <li>«ҚҰРМЕТТІ ҰСТАЗ» афишасындағы ҚАТЫСАМЫН батырмасын басыңыз.</li>
                <li>БАЙҚАУ ережесі шығады, ТОЛЫҒЫРАҚ батырмасын басып, ережемен танысыңыз. Талаптарға келіссеңіз, МАТЕРИАЛ ЖАРИЯЛАУ батырмасын басыңыз.</li>
                <li>Анкета толтыру парақшасы ашылады.</li>
                <li>ШАБЛОНДЫ ЖҮКТЕҢІЗ деген жердегі шаблонды жүктеп алыңыз. Сол шаблонды ашып, өзіңіз туралы мәліметті және материалыңызды орналастырыңыз.</li>
                <li>Материалыңыз бен мәліметті толтырып, сақтағаннан кейін Анкетаны қатесіз толтыруыңыз қажет. ФАЙЛДЫ ЖҮКТЕУ дегенді басып, дайындаған материалыңызды сайтқа орналастырыңыз.</li>
                <li>Сертификат шығады, сақтап алыңыз.</li>
            </ul>
            <p>
                <b>Байқауға қатысушы педагогтың материалына қойылатын талап:</b>  форматы doc, кегель 14, шрифт Times New Roman болуы шарт. Материалдың жоғары бөлігінде педагогтың толық аты-жөні, мектебі, пәні, облыс, ауданы, жетістіктері ретімен жазылуы міндетті.
            </p>
            <p>
                Байқау материалын bilim-shini.kz сайтында жариялау, СЕРТИФИКАТ алу ТЕГІН!!!
            </p>
            <p>
                <b>БАЙҚАУ ҚОРТЫНДЫСЫ:</b>
                <br>Байқаудың барлық қатысушылары Сертификатталады.
                <br>Байқауға қатысаушылардың сайттағы материалдары Байқау комиссиясына жіберіледі.
                <br>Байқау жеңімпаздарын арнайы құрылған комиссия (педагогика,  психология және әдістеме саласының ғылым қайраткерлері, ардагер ұстаздар, жаңашыл педагогтер, әдіскерлер және қоғамдық ұйымдардың өкілдері) анықтайды.
                <br>Байқау жеңімпаздарының марапаттары «Мұғалімдер күні» мерекесі қарсаңында беріледі.
            </p>
            <p>
                <b>БАЙҚАУ ЖЕҢІМПАЗДАРЫНЫҢ МАРАПАТТАРЫ:</b>
                <br>Байқау жеңімпаздарына «ҚҰРМЕТТІ ҰСТАЗ» төсбелгісі және арнайы Грамотасы ҚАЗПОШТА арқылы жіберіледі.
            </p>
            <p>
                <b>ҰЙЫМДАСТЫРУШЫЛАР:</b> «Білім шыңы-Ғылым сыры» редакциясы
                <br>Қосымша сұрақтар бойынша:
                <br><a href="https://wa.me/77754037284">https://wa.me/77754037284</a>
                <br><a href="https://wa.me/77013129906">https://wa.me/77013129906</a>
            </p>
        </div>
    <?php else: ?>
        <p>
            В разделе "Публикация" - вы можете найти планы уроков, открытые уроки и учебные часы, и другие документы, необходимые учителям.
        </p>
        <p>
            <b>ЗДРАВСТВУЙ, УВАЖАЕМЫЙ ПЕДАГОГ!</b><br>
            <p>
                Вы можете получить Сертификат со 100% действительным для портфолио QR-кодом, опубликовав свой материал на сайте электронного журнала «Білім шыңы-Ғылым сыры»
            </p>
            <p>
                Ваш материал будет включен в базу данных ПУБЛИКАЦИИ МАТЕРИАЛОВ нашего сайта, что создаст площадку для практики учителей
            </p>
            <a id="toggleBtn" style="color: blue" href="#">Подробнее </a>
        </p>
        <div id="toggleText" style="display: none">
            <p><b>УСЛОВИЯ ПУБЛИКАЦИИ МАТЕРИАЛОВ:</b></p>
            <p>
                1. Нажмите на кнопку ПУБЛИКАЦИЯ МАТЕРИАЛА. 
            </p>
            <p>
                2. Заполните анкету полностью и без ошибок. 
            </p>
            <p>
                3. Перейдите на страницу оплаты. (Взнос публикации материала – 3000 тг.)
            </p>
            <p>
                4. Находясь на сайте, Вы можете произвести ОПЛАТУ любой платежной картой. 
            </p>
            <p>
                5. Сразу после оплаты Вы разместите свой материал на сайте. Выйдет сертификат. Скачайте. Вы можете опубликовать Ваш материал 3 раза по трем темам и получить Сертификат. 
            </p>
            <p>
                6. Если на сайте сложно произвести оплату, Вы можете произвести перевод на номер КАСПИЙ ГОЛД   8708 317 65 16 Динара Куралбекова и отправить чек об оплате и ИИН на wadsap номер. Вам предоставят доступ к публикации материалов.
            </p>
            <p>
                По дополнительным вопросам на Whatsapp:
                <br>
                https://wa.me/77013129906
                <br>
                https://wa.me/77083176516
            </p>
        </div>
    <?php endif; ?>
    <a class="article-order-widget__link btn btn-success" href="<?= Url::to(['article/order']) ?>">
        <?= Yii::t('app', 'Опубликовать материал') ?>
    </a>
</div>
<div class="row" style="padding-top: 20px">
    <?php foreach ($subjects as $subject): ?>
    <div class="col-md-3">
        <a class="subject-list__item" style="background: linear-gradient(90deg, rgba(0,0,0,0.4) 10%, rgba(0,0,0,0.4) 40%), url('<?= '/img/' . $subject->img ?>')" href="<?= Url::to(['article/list', 'id' => $subject->id]) ?>">
            <h5><?= $subject->getName() ?></h5>
        </a>
    </div>
    <?php endforeach; ?>
</div>
<?php
$js =<<<JS
$('#toggleBtn').click(function() {
  $('#toggleText').toggle('ease');
});
JS;

$this->registerJs($js);
?>