<?php
use common\models\Subject;
use yii\helpers\Url;

/* @var $this \yii\web\View */
/* @var $subjects Subject */
/* @var $subject Subject */

$this->title = Yii::t('app', 'Материалы');
$this->params['breadcrumbs'][] = ['label' => $this->title, 'url' => ['article/index']];
$this->params['heroTitle'] = $this->title;
$this->params['heroDescription'] = 'БІЛІМ ШЫҢЫ - ҒЫЛЫМ СЫРЫ';
?>
<div>
    <?php if (Yii::$app->language === 'kz'): ?>
    <p>
        «Материал жариялау» бөлімінен -   сабақ жоспарларын, ашық сабақтар мен тәрбие сағаттарын және басқа да мұғалімдерге керекті құжаттарды таба аласыз.
    </p>
    <p>
        <b>СӘЛЕМЕТСІЗ БЕ, ҚҰРМЕТТІ ПЕДАГОГ!</b><br>
        Сіз «Білім шыңы-Ғылым сыры» журналының 2022 жылдың 6 айына жазыла отырып біздің порталда 3 рет өз материалыңызды тегін жариялап, портфолиоға 100 % жарамды Сертификатты небәрі 2 минутта тегін иемдене аласыз.
        <a id="toggleBtn" style="color: blue" href="#">Толығырақ</a>
    </p>
    <div id="toggleText" style="display: none">
        <ul>
            <li>
                Сіздің материалыңыз біздің сайттың МАТЕРИАЛ ЖАРИЯЛАУ базасына түседі, бұл басқа педагогтар үшін үлкен көмек құралы болады. Жарияланым туралы Сертификатты өз портфолиоңызға қоса аласыз және аттестаттау комиссиясының лайықты бағасын ала аласыз, осылайша біліктілік санатыңызды арттыра аласыз.
            </li>
            <li>
                2022 жылы 6 ай бойы Сіздің мекен-жайыңызға журнал жіберіледі. Біздің журнал сіздің шын сырлас досыңызға айналады.
            </li>
            <li>
                «Білім шыңы-Ғылым сыры» журналы ҚР Инвестициялар және Даму Министрлігінің Байланыс, Ақпараттандыру және Ақпарат комитетіне тіркелген. Тіркеу куәлігі №15454-Ж (01.07.2015)
            </li>
            <li>
                Айына 1 рет шығады. Журнал түрлі-түсті 36 беттен тұрады.
            </li>
            <li>
                Сайтқа тіркеліп, журналға жазылған күннен бастап 2022 жылдың маусым айына дейін кез келген уақытта өз шығармашылық жұмыстарыңыздан 3 рет bilimshini.kz сайтында жариялауға мүмкіндігіңіз бар.
            </li>
            <li>
                Журналға 6 айға жазылу құны - 3000 теңге
            </li>
            <li>
                Журналға жазылу операциясын орындағаннан кейін материалыңызды жариялауыңызға болады.
            </li>
            <li>
                Сертификатта қандай мәліметтер көрсетіледі:
                Сіздің аты-жөніңіз, cайттың аты, авторлық құқықты дәлелдейтін жеке QR  номері, материалдың толық тақырыбы, облыс, аудан, мектеп аты және берілген уақыты.
            </li>
            <li>
                Сертификаттың берілу уақыты:
                Сертификат материалыңызды жариялағаннан кейін 2 минут ішінде беріледі. Сайттан жүктеп аласыз.
            </li>
        </ul>

        <a class="btn btn-success" href="<?= Url::to(['site/subscribe']) ?>">Жазылу</a>
    </div>
    <?php else: ?>
        <p>
            Здравствуйте, уважаемые коллеги! Вы можете бесплатно опубликовать свой материал и получить Сертификат на нашем портале 3 раза, подписавшись на журнал «Білім шыңы-Ғылым сыры»  на 6 месяцев 2022 года. Ваш материал будет включен в базу публикаций нашего сайта, что будет полезно другим педагогам.
        </p>
        <p>
            Вы можете включить сертификат о ПУБЛИКАЦИИ в свое портфолио и получить достойную оценку аттестационной комиссии, тем самым повысив свою квалификационную категорию. В 2022 году в течение 6 месяцев на Ваш адрес будет отправлен журнал. Наш журнал станет вашим настоящим другом.  Подробнее
            <a id="toggleBtn" style="color: blue" href="#">Подробнее</a>
        </p>
        <div id="toggleText" style="display: none">
            <p>
                •	Для педагогов дошкольных и общеобразовательных школ, лицеев, гимназий, колледжей РК
            </p>
            <p>
                •	Зарегистрирован в комитете связи, информатизации и информации Министерства по инвестициям и развитию РК. Регистрационное свидетельство №15454-Ж (01.07.2015)
            </p>
            <p>
                •	Публикуется 1 раз в месяц. Журнал состоит из 36 цветных страниц
            </p>
            <p>
                •	Если вы подпишетесь на журнал на 6 месяцев 2022 года, вы сможете получать выпуски журнала за январь, февраль, март, апрель, май, июнь месяцев
            </p>
            <p>
                •	Если вы подписались на 6 месяцев, то Вы можете 3 раза бесплатно опубликовать свой материал и 3 раза получить Сертификат. У вас есть возможность опубликовать свой материал в любое время со дня регистрации на сайте и подписки на журнале до июня 2022 года.
            </p>
            <p>
                •	Стоимость подписки на журнал на 6 месяцев - 3000 тенге
            </p>
            <a class="btn btn-success" href="<?= Url::to(['site/subscribe']) ?>">Подписаться</a>
        </div>
    <?php endif; ?>
</div>
<div class="row" style="padding-top: 20px">
    <?php foreach ($subjects as $subject): ?>
    <div class="col-md-3">
        <a class="subject-list__item" style="background: linear-gradient(90deg, rgba(0,0,0,0.4) 10%, rgba(0,0,0,0.4) 40%), url('<?= '/img/' . $subject->img ?>')" href="<?= Url::to(['article/list', 'id' => $subject->id]) ?>">
            <h5><?= $subject->getName() ?></h5>
        </a>
    </div>
    <?php endforeach; ?>
</div>
<?php
$js =<<<JS
$('#toggleBtn').click(function() {
  $('#toggleText').toggle('ease');
});
JS;

$this->registerJs($js);
?>