<?php
use common\models\Subject;
use yii\helpers\Url;

/* @var $this \yii\web\View */
/* @var $subjects Subject */
/* @var $subject Subject */

$this->title = Yii::t('app', 'Материалы');
$this->params['breadcrumbs'][] = ['label' => $this->title, 'url' => ['article/index']];
$this->params['heroTitle'] = $this->title;
$this->params['heroDescription'] = 'БІЛІМ ШЫҢЫ - ҒЫЛЫМ СЫРЫ';
?>
<div>
    <?php if (Yii::$app->language === 'kz'): ?>
    <p>
        Сәлеметсіз бе, құрметті педагог! Сіз «Білім шыңы-Ғылым сыры» журналының 2022 жылдың 6 айына жазыла отырып біздің порталда 3 рет өз материалыңызды тегін жариялап, Сертификат иемдене аласыз.
    </p>
    <p>
        Сіздің материалыңыз біздің сайттың МАТЕРИАЛ ЖАРИЯЛАУ базасына түседі, бұл басқа педагогтар үшін үлкен көмек құралы болады. Жарияланым туралы Сертикатты өз портфолиоңызға қоса аласыз және аттестаттау комиссиясының лайықты бағасын ала аласыз, осылайша біліктілік санатыңызды арттыра аласыз.
        2022 жылы 6 ай бойы Сіздің мекен-жайға журнал жіберіледі. Біздің журнал сіздің шын сырлас досыңызға айналады.
        <a id="toggleBtn" style="color: blue" href="#">Толығырақ</a>
    </p>
    <div id="toggleText" style="display: none">
        <p>
            • ҚР мектепке дейінгі және жалпы білім беретін мектеп, лицей, гимназия, колледж педагогтарына арналған
        </p>
        <p>
            •	ҚР Инвестициялар және Даму Министрлігінің Байланыс, Ақпараттандыру және Ақпарат комитетіне тіркелген.
            Тіркеу куәлігі №15454-Ж (01.07.2015)
        </p>
        <p>
            •	Айына 1 рет шығады.  Журнал түрлі-түсті 36 беттен тұрады.
        </p>
        <p>
            •	Егер Сіз журналға 2022 жылдың 6 айына жазылсаңыз, қаңтар, ақпан, наурыз, сәуір, мамыр, маусым айларының номерлерін ала аласыз.
        </p>
        <p>
            •	Егер Сіз 6 айға жазылсаңыз журналға, 3 рет материалыңызды тегін жариялап, 3 рет Сертификат алу мүмкіндігіне ие боласыз. Сайтқа тіркеліп, журналға жазылған күннен бастап 2022 жылдың маусым айына дейін кез келген уақытта өз материалыңызды жариялауға мүмкіндігіңіз бар.

        </p>
        <p>
            •	Журналға 6 айға жазылу құны  - 3000 теңге
        </p>
    </div>
    <?php else: ?>
        <h4>УВАЖАЕМЫЙ ПЕДАГОГ!</h4>
        Для портфолио достижений <br>
        БМЫ ВСЕГДА ГОТОВЫ ОКАЗАТЬ ВАМ ТВОРЧЕСКУЮ ПОДДЕРЖКУ! <br>
        <b>В ЭТОМ РАЗДЕЛЕ ВЫ: </b> <br>
        <p>
            Можете публиковать планы открытых уроков, уроки, ксп, ссп, дсп, ктп, сценарии, воспитательные часы, творческие работы учителей и учащихся, научные работы, передовые опыты.
        </p>
        <p>
            После добавления вашего материала вы получите сертификат об опубликовании. <br>
            По дополнительному вопросу вы можете нажать на ссылку вадсапа <a href="https://wa.me/77750767876">https://wa.me/77750767876</a>
        </p>
    <p>
        <b>Чтобы опубликовать материал, выберите предмет и в открывшемся окне нужно нажать на кнопку "Опубликовать материал"</b>
    </p>
    <?php endif; ?>
</div>
<div class="row" style="padding-top: 20px">
    <?php foreach ($subjects as $subject): ?>
    <div class="col-md-3">
        <a class="subject-list__item" style="background: linear-gradient(90deg, rgba(0,0,0,0.4) 10%, rgba(0,0,0,0.4) 40%), url('<?= '/img/' . $subject->img ?>')" href="<?= Url::to(['article/list', 'id' => $subject->id]) ?>">
            <h5><?= $subject->getName() ?></h5>
        </a>
    </div>
    <?php endforeach; ?>
</div>
<?php
$js =<<<JS
$('#toggleBtn').click(function() {
  $('#toggleText').toggle('ease');
});
JS;

$this->registerJs($js);
?>