<div class="container pt--40 pb--40">
    <h2>
        Политика конфиденциальности
    </h2>
    <div>
        <p class="mt-4">
            Существующая на текущий момент политика конфиденциальности
            персональных данных (далее – Политика конфиденциальности) работает со
            следующими понятиями:
        </p>
        <ul class="list-group">
            <li class="list-group-item">
                «Администрация сайта (далее – Администрация
                сайта)». Так называют представляющих интересы организации
                специалистов, в чьи обязанности входит управление сайтом, то есть
                организация и (или) обработка поступивших на него персональных
                данных. Для выполнения этих обязанностей они должны чётко
                представлять, для чего обрабатываются сведения, какие сведения
                должна быть обработаны, какие действия (операции) должны
                производиться с полученными сведениями.
            </li>
            <li class="list-group-item">
                «Персональные данные» — сведения, имеющие прямое или косвенное
                отношение к определённому либо определяемому физическому лицу (также
                называемому субъектом персональных данных).
            </li>
            <li class="list-group-item">
                «Обработка персональных данных» — любая операция (действие) либо
                совокупность таковых, которые Администрация производит с
                персональными данными. Их могут собирать, записывать,
                систематизировать, накапливать, хранить, уточнять (при необходимости
                обновлять или изменять), извлекать, использовать, передавать
                (распространять, предоставлять, открывать к ним доступ),
                обезличивать, блокировать, удалять и даже уничтожать. Данные
                операции (действия) могут выполняться как автоматически, так и
                вручную.
            </li>
            <li class="list-group-item">
                «Конфиденциальность персональных данных» — обязательное требование,
                предъявляемое к Оператору или иному работающему с данными
                Пользователя должностному лицу, хранить полученные сведения в тайне,
                не посвящая в них посторонних, если предоставивший персональные
                данные Пользователь не изъявил своё согласие, а также отсутствует
                законное основание для разглашения.
            </li>
            <li class="list-group-item">
                «Пользователь сайта» (далее — Пользователь)» –
                человек, посетивший сайт, а также пользующийся его
                программами и продуктами.
            </li>
            <li class="list-group-item">
                «Cookies» — короткий фрагмент данных, пересылаемый веб-браузером или
                веб-клиентом веб-серверу в HTTP-запросе, всякий раз, когда
                Пользователь пытается открыть страницу Интернет-магазина. Фрагмент
                хранится на компьютере Пользователя.
            </li>
            <li class="list-group-item">
                «IP-адрес» — уникальный сетевой адрес узла в компьютерной сети,
                построенной по протоколу TCP/IP.
            </li>
        </ul>
        <br />
        <div>
            <h4>Общие положения</h4>
            <p>
                Просмотр сайта Интернет-магазина, а также использование его программ
                и продуктов подразумевают автоматическое согласие с принятой там
                Политикой конфиденциальности, подразумевающей предоставление
                Пользователем персональных данных на обработку.
            </p>
            <p>
                Если Пользователь не принимает существующую Политику
                конфиденциальности, Пользователь должен покинуть Интернет-магазин.
            </p>
            <p>
                Имеющаяся Политика конфиденциальности распространяется только на
                сайт. Если по ссылкам, размещённым на сайте
                последнего, Пользователь зайдёт на ресурсы третьих лиц,
                Интернет-магазин за его действия ответственности не несёт.
            </p>
            <p>
                Проверка достоверности персональных данных, которые решил сообщить
                принявший Политику конфиденциальности Пользователь, не входит в
                обязанности Администрации сайта.
            </p>
        </div>
        <br />

        <h4 class="text-2xl font-bold mb-2">
            Предмет политики конфиденциальности
        </h4>
        <p>
            Согласно проводимой в текущий период Политике конфиденциальности
            Администрация сайта обязана не разглашать персональные
            данные, сообщаемые Пользователями, регистрирующимися на сайте или
            оформляющими заказ на покупку товара, а также обеспечивать этим данным
            абсолютную конфиденциальность.
        </p>

        <p>
            Чтобы сообщить персональные данные, Пользователь заполняет
            расположенные на сайте электронные формы.
            Персональными данными Пользователя, которые подлежат обработке,
            являются:
        </p>
        <ul class="list-group">
            <li class="list-group-item">его фамилия, имя, отчество;</li>
            <li class="list-group-item">его контактный телефон;</li>
            <li class="list-group-item">его электронный адрес (e-mail);</li>
        </ul>
        <p class="mt-4">
            Защита данных, автоматически передаваемых при просмотре рекламных
            блоков и посещении страниц с установленными на них статистическими
            скриптами системы (пикселями) осуществляется Интернет-магазином. Вот
            перечень этих данных:
        </p>
        <ul class="list-group">
            <li class="list-group-item">IP-адрес;</li>
            <li class="list-group-item">сведения из cookies;</li>
            <li class="list-group-item">
                сведения о браузере (либо другой программе, через которую становится
                доступен показ рекламы);
            </li>
            <li class="list-group-item">время посещения сайта;</li>
            <li class="list-group-item">адрес страницы, на которой располагается рекламный блок;</li>
            <li class="list-group-item">реферер (адрес предыдущей страницы).</li>
            <li class="list-group-item">
                Последствием отключения cookies может стать невозможность доступа к
                требующим авторизации частям сайта Интернет-магазина.
            </li>
            <li class="list-group-item">
                Интернет-магазин собирает статистику об IP-адресах всех посетителей.
                Данные сведения нужны, чтобы выявить и решить технические проблемы и
                проконтролировать, насколько законным будет проведение финансовых
                платежей.
            </li>
            <li class="list-group-item">
                Любые другие неоговорённые выше персональные сведения (о том, когда
                и какие покупки были сделаны, какой при этом использовался браузер,
                какая была установлена операционная система и пр.) надёжно хранятся
                и не распространяются. Исключение существующая Политика
                конфиденциальности предусматривает для случаев, описанных в п.п. 5.2
                и 5.3.
            </li>
        </ul>

        <h4 class="mt-4">
            Цели сбора персональной информации пользователя
        </h4>
        <p>
            Сбор персональных данных Пользователя Администрацией Интернет-магазина
            проводится ради того, чтобы:
        </p>
        <ul class="list-group">
            <li class="list-group-item">
                Идентифицировать Пользователя, который прошёл процедуру регистрации
                на сайте, чтобы участвовать в олимпиаде.
            </li>
            <li class="list-group-item">
                Открыть Пользователю доступ к персонализированным ресурсам данного
                сайта.
            </li>
            <li class="list-group-item">
                Установить с Пользователем обратную связь, под которой
                подразумевается, в частности, рассылка запросов и уведомлений,
                касающихся использования сайта Интернет-магазина, обработка
                пользовательских запросов и заявок, оказание прочих услуг.
            </li>
            <li class="list-group-item">
                Определить местонахождение Пользователя, чтобы обеспечить
                безопасность платежей и предотвратить мошенничество.
            </li>
            <li class="list-group-item">
                Подтвердить, что данные, которые предоставил Пользователь, полны и
                достоверны.
            </li>
            <li class="list-group-item">
                Создать учётную запись для совершения Покупок, если Пользователь
                изъявил на то своё желание.
            </li>
            <li class="list-group-item">
                Уведомить Пользователя о состоянии его заказа в Интернет-магазине.
            </li>
            <li class="list-group-item">
                Обрабатывать и получать платежи, подтверждать налог или налоговые
                льготы, оспаривать платёж, определять, целесообразно ли предоставить
                конкретному Пользователю кредитную линию.
            </li>
            <li class="list-group-item">
                Обеспечить Пользователю максимально быстрое решение проблем,
                встречающихся при использовании Интернет-магазина, за счёт
                эффективной клиентской и технической поддержки.
            </li>
            <li class="list-group-item">
                Своевременно информировать Пользователя об обновлённой продукции,
                ознакомлять его с уникальными предложениями, новыми прайсами,
                новостями о деятельности сайт или его партнёров и
                прочими сведениями, если Пользователь изъявит на то своё согласие.
            </li>
            <li class="list-group-item">
                Предоставить Пользователю доступ на сайты или сервисы
                Интернет-магазина, помогая ему тем самым получать продукты,
                обновления и услуги.
            </li>
        </ul>
        <br />

        <h4>
            Способы и сроки обработки персональной информации
        </h4>
        <ul class="list-group">
            <li class="list-group-item">
                Срок обработки персональных данных Пользователя ничем не ограничен.
                Процедура обработки может проводиться любым предусмотренным
                законодательством способом. В частности, с помощью информационных
                систем персональных данных, которые могут вестись автоматически либо
                без средств автоматизации.
            </li>
            <li class="list-group-item">
                Также обработанные Администрацией сайта персональные данные могут
                передаваться уполномоченным органов государственной власти
                Российской Федерации, если это осуществляется на законных основаниях
                и в предусмотренном российским законодательством порядке.
            </li>
            <li class="list-group-item">
                Если персональные данные будут утрачены или разглашены, Пользователь
                уведомляется об этом Администрацией сайта.
            </li>
            <li class="list-group-item">
                Все действия Администрации сайта направлены на то, чтобы не
                допустить к персональным данным Пользователя третьих лиц (за
                исключением п.п. 5.2, 5.3). Последним эта информация не должна быть
                доступна даже случайно, дабы те не уничтожили её, не изменили и не
                блокировали, не копировали и не распространяли, а также не совершали
                прочие противозаконные действия. Для защиты пользовательских данных
                Администрация располагает комплексом организационных и технических
                мер.
            </li>
            <li class="list-group-item">
                Если персональные данные будут утрачены либо разглашены,
                Администрация сайта совместно с Пользователем готова принять все
                возможные меры, дабы предотвратить убытки и прочие негативные
                последствия, вызванные данной ситуацией.
            </li>
        </ul>

        <h4 class="mt-4">Обязательства сторон</h4>
        <p>В обязанности Пользователя входит:</p>
        <ul class="list-group">
            <li class="list-group-item">
                Сообщение соответствующих требованиям сайт сведений о
                себе.
            </li>
            <li class="list-group-item">
                Обновление и дополнение предоставляемых им сведений в случае
                изменения таковых.
            </li>
        </ul>
        <p class="mt--40">В обязанности Администрации сайта входит:</p>
        <ul class="list-group">
            <li class="list-group-item">
                Применение полученных сведений исключительно в целях, обозначенных в
                п. 4 существующей Политики конфиденциальности.
            </li>
            <li class="list-group-item">
                Обеспечение конфиденциальности поступивших от Пользователя сведений.
                Они не должны разглашаться, если Пользователь не даст на то
                письменное разрешение. Также Администрация не имеет права продавать,
                обменивать, публиковать либо разглашать прочими способами переданные
                Пользователем персональные данные, исключая п.п. 5.2 и 5.3
                существующей Политики конфиденциальности.
            </li>
            <li class="list-group-item">
                Принятие мер предосторожности, дабы персональные данные Пользователя
                оставались строго конфиденциальными, точно также, как остаются
                конфиденциальными такого рода сведения в современном деловом
                обороте.
            </li>
            <li class="list-group-item">
                Блокировка персональных пользовательских данных с того момента, с
                которого Пользователь либо его законный представитель сделает
                соответствующий запрос. Право сделать запрос на блокировку также
                предоставляется органу, уполномоченному защищать права Пользователя,
                предоставившего Администрации сайта свои данные, на период проверки,
                в случае обнаружения недостоверности сообщённых персональных данных
                либо неправомерности действий.
            </li>
        </ul>
        <br />
        <h4 class="text-2xl font-bold mb-2">Ответственность сторон</h4>
        <ul class="list-group">
            <li class="list-group-item">
                В случае неисполнения Администрацией сайта собственных обязательств
                и, как следствие, убытков Пользователя, понесённых из-за
                неправомерного использования предоставленной им информации,
                ответственность возлагается на неё. Об этом, в частности, утверждает
                российское законодательство. Исключение существующая в настоящее
                время Политика конфиденциальности делает для случаев, отражённых в
                п.п. 5.2, 5.3 и 7.2.
            </li>
        </ul>
        <p class="mt--40">
            Но существует ряд случаев, когда Администрация сайта ответственности
            не несёт, если пользовательские данные утрачиваются или разглашаются.
            Это происходит тогда, когда они:
        </p>
        <ul class="list-group">
            <li class="list-group-item">
                Превратились в достояние общественности до того, как были утрачены
                или разглашены.
            </li>
            <li class="list-group-item">
                Были предоставлены третьими лицами до того, как их получила
                Администрация сайта.
            </li>
            <li class="list-group-item">Разглашались с согласия Пользователя.</li>
        </ul>
        <br />

        <h4>Разрешение споров</h4>
        <ul class="list-group">
            <li class="list-group-item">
                Если Пользователь недоволен действиями Администрации
                сайт и намерен отстаивать свои права в суде, до того
                как обратиться с иском, он в обязательном порядке должен предъявить
                претензию (письменно предложить урегулировать конфликт добровольно).
            </li>
            <li class="list-group-item">
                Получившая претензию Администрация обязана в течение 30 календарных
                дней с даты её получения письменно уведомить Пользователя о её
                рассмотрении и принятых мерах.
            </li>
            <li class="list-group-item">
                Если обе стороны так и не смогли договориться, спор передаётся в
                судебный орган, где его должны рассмотреть согласно действующему
                российскому законодательству.
            </li>
            <li class="list-group-item">
                Регулирование отношений Пользователя и Администрации сайта в
                Политике конфиденциальности проводится согласно действующему
                российскому законодательству.
            </li>
        </ul>
        <br />

        <h4>Дополнительные условия</h4>
        <ul class="list-group">
            <li class="list-group-item">
                Администрация сайта вправе менять существующую на текущий момент
                Политику конфиденциальности, не спрашивая согласия у Пользователя.
            </li>
            <li class="list-group-item">
                Вступление в силу новой Политики конфиденциальности начинается после
                того, как информация о ней будет выложена на сайт,
                если изменившаяся Политика не подразумевает иного варианта
                размещения.
            </li>
            <li class="list-group-item">
                Все предложения, пожелания, требования или вопросы по настоящей
                Политике конфиденциальности следует сообщать в раздел обратной
                связи, расположенный по адресу:
                <a class="text-blue-500" href="https://bilim-shini.kz/contact">https://bilim-shini.kz/contact</a>.
                Или путем отправки электронного письма по адресу
                <a class="text-blue-500" href="mailto:bilimshini.kz@gmail.com">
                    bilimshini.kz@gmail.com
                </a>
            </li>
            <li class="list-group-item">
                Прочитать о существующей Политике конфиденциальности можно, зайдя на
                страницу по адресу
                <a class="text-blue-500" href="https://bilim-shini/kz/site/policy">
                    https://bilim-shini/kz/site/policy
                </a>
            </li>
        </ul>
    </div>
</div>
<style>
    .list-group-item {
        margin: 0;
        padding: 20px;
    }
</style>