<?php

/* @var $this \yii\web\View */

$this->title = Yii::t('app', 'Редакция');

$this->params['breadcrumbs'][] = ['label' => $this->title, 'url' => ['site/about']];
?>
<h1><?= Yii::t('app', 'Редакция') ?></h1>
<div class="row">
    <div class="col-md-4">

    </div>
    <div class="col-md-8">
        <h1>БІЛІМ ШЫҢЫ - ҒЫЛЫМ СЫРЫ</h1>
        <div style="color: red; font-weight: 600">
            Құрлығанына 5 жыл
        </div>
        <p>
            “Білім шыңы - Ғылым сыры” журналы - педагогтар мен оқушыларға арналған республикалық ғылыми-әдістемелік, танымдық, мәдени-рухани журнал.
        </p>
        <p>
            Біз «Білім шыңы-Ғылым сыры» журналы арқылы Қазақ Елінің қарыштап дамып, гүлденуі жолында еңбек етіп, білім саласын дамытуға өз мүмкіндігімізше үлес қосуға ұмтылудамыз.
        </p>
        <p>
            Жаңартылған білім беру бағдарламасының жүзеге асуына ақпараттық қолдау көрсете отырып, педагогикалық тәжірибелерді тарату, мектеп жетістіктерін, ұлағатты ұстаздардың өнегелі ісін, дарынды оқушылардың жеңістерін насихаттап, елге үлгі ету, мұғалімдер мәртебесінің артуына ықпал ету журналдың басты мақсаты болып табылады.
        </p>
        <p>
            “Білім шыңы-Ғылым сыры” журналы  педагогтардың кәсіби шеберлігін арттыруда, шығармашылығын шыңдауда, озық  іс-тәжірибелерді таратуда таптырмайтын  баспасөз құралы.
        </p>
        <p>
            “Білім шыңы - Ғылым сыры” журналы – білімге ұмтылған Ел үні, ұстаздардың сенімді серігі. Ұстаздар үшін үлкен қазына болып саналатын журналымызға жазылыңыздар, әрдайым жанымыздан табылыңыздар! Әрдайым бірге болайық, жарқын болашаққа бірге барайық, ҚҰРМЕТТІ ҰСТАЗДАР!
        </p>
        <p style="color: red">
            “Білім шыңы-Ғылым сыры” журналына Қазпошта арқылы <br>
            6 айға жазылу бағасы  - 2565 теңге 60 тиын <br>
            Жазылу индексі: 74871
        </p>
    </div>
</div>