<?php

/* @var $this \yii\web\View */

$this->title = Yii::t('app', 'Редакция');

$this->params['breadcrumbs'][] = ['label' => $this->title, 'url' => ['site/about']];
?>
<h1><?= Yii::t('app', 'Редакция') ?></h1>
<div class="row">
    <div class="col-md-6">
        <div class="row">
            <div class="col-md-12" style="display: flex; justify-content: center;">
                <div class="about__director-wrapper">
                    <img class="about-image" src="/img/11.png" alt="11">
                    <div class="staff-info">
                        <div class="staff-name">Есен Бахытгул Артыққызы</div>
                        <div class="staff-job">Бас редактор</div>
                    </div>
                </div>
            </div>
        </div>
        <div class="row">
            <div class="col-md-6">
                <img class="about-image" src="/img/33.png" alt="33">
                <div class="staff-info">
                    <div class="staff-name">Бекзат Рүстем</div>
                    <div class="staff-job">Шығармашылық директор</div>
                </div>
            </div>
            <div class="col-md-6">
                <img class="about-image" src="/img/44.png" alt="44">
                <div class="staff-info">
                    <div class="staff-name">Усипова Жанна</div>
                    <div class="staff-job">Фото-тілші</div>
                </div>
            </div>
        </div>
        <div class="row">
            <div class="col-md-6">
                <img class="about-image" src="/img/55.png" alt="55">
                <div class="staff-info">
                    <div class="staff-name">Изтаева Феруза</div>
                    <div class="staff-job">Фото-тілші</div>
                </div>
            </div>
            <div class="col-md-6">
                <img class="about-image" src="/img/66.png" alt="66">
                <div class="staff-info">
                    <div class="staff-name">Анаркулов Ислам</div>
                    <div class="staff-job">Бас дизайнер</div>
                </div>
            </div>
        </div>
    </div>
    <div class="col-md-6">
        <?php if (Yii::$app->language === 'kz'): ?>
            <h2>БІЛІМ ШЫҢЫ - ҒЫЛЫМ СЫРЫ</h2>
            <p style="color: red; font-weight: 600">
                Құрылғанына 5 жыл
            </p>
            <p>
                <i>
                    Журнал  Қазақстан Республикасының Инвестициялар және Даму Министрлігі <br>
                    Байланыс, Ақпараттандыру және Ақпарат комитетінде есепке қойылды. <br>
                    Тіркеу куәлігі №15454-Ж (01.07.2015)
                </i>
            </p>
            <p>
                “Білім шыңы - Ғылым сыры” журналы - педагогтар мен оқушыларға арналған республикалық ғылыми-әдістемелік, танымдық, мәдени-рухани журнал.
            </p>
            <p>
                Біз «Білім шыңы-Ғылым сыры» журналы арқылы Қазақ Елінің қарыштап дамып, гүлденуі жолында еңбек етіп, білім саласын дамытуға өз мүмкіндігімізше үлес қосуға ұмтылудамыз.
            </p>
            <p>
                Жаңартылған білім беру бағдарламасының жүзеге асуына ақпараттық қолдау көрсете отырып, педагогикалық тәжірибелерді тарату, мектеп жетістіктерін, ұлағатты ұстаздардың өнегелі ісін, дарынды оқушылардың жеңістерін насихаттап, елге үлгі ету, мұғалімдер мәртебесінің артуына ықпал ету журналдың басты мақсаты болып табылады.
            </p>
            <p>
                “Білім шыңы-Ғылым сыры” журналы  педагогтардың кәсіби шеберлігін арттыруда, шығармашылығын шыңдауда, озық  іс-тәжірибелерді таратуда таптырмайтын  баспасөз құралы.
            </p>
            <p>
                “Білім шыңы - Ғылым сыры” журналы – білімге ұмтылған Ел үні, ұстаздардың сенімді серігі. Ұстаздар үшін үлкен қазына болып саналатын журналымызға жазылыңыздар, әрдайым жанымыздан табылыңыздар! Әрдайым бірге болайық, жарқын болашаққа бірге барайық, ҚҰРМЕТТІ ҰСТАЗДАР!
            </p>
            <p style="color: red">
                “Білім шыңы-Ғылым сыры” журналына Қазпошта арқылы <br>
                6 айға жазылу бағасы  - 2565 теңге 60 тиын <br>
                Жазылу индексі: 74871
            </p>
        <?php else: ?>
            <h2>БІЛІМ ШЫҢЫ - ҒЫЛЫМ СЫРЫ</h2>
            <p style="color: red; font-weight: 600">
                5 лет со дня образования
            </p>
        <p>
            <i>
                Журнал   постановлен на учет <br>
                Комитета связи, информатизации и информации <br>
                Свидетельство  №15454-Ж (01.07.2015)
            </i>
        </p>
            <p>
                Журнал "Білім шыңы-Ғылым сыры" - Республиканский научно-методический, познавательный, культурно-духовный журнал для педагогов и учащихся.
            </p>
            <p>
                Мы посредсвом  журнала «Білім шыңы-Ғылым сыры» стремимся внести свой вклад в развитие образования, работая на стремительное развитие и процветание казахстанского народа.
            </p>
            <p>
                Основная цель журнала - распространение педагогического опыта, информационная поддержка реализации обновленной образовательной программы, популяризация школьных достижений, нравственного труда талантливых учителей, побед талантливых учеников, повышение статуса учителей.
            </p>
            <p>
                Журнал "Білім шыңы-Ғылым сыры" является незаменимым инструментом для повышения профессионального мастерства педагогов, совершенствования творчества, распространения передового опыта.
            </p>
            <p>
                Журнал "Білім шыңы - Ғылым сыры" - это голос страны, стремящийся к знаниям, надежный партнер педагогов. Подпишитесь на наш журнал, который является большой сокровищницей для учителей, и всегда находитесь  рядом с нами!  ДОРОГИЕ УЧИТЕЛЯ, двавйте будем  всегда вместе, и вместе идти в светлое будущее!
            </p>
            <p style="color: red">
                Подписка на журнал " Білім шыңы-Ғылым сыры” через Казпочту <br>
                Подписная цена на 6 месяцев-2565 тенге 60 тиын <br>
                Подписной индекс: 74871
            </p>
        <?php endif; ?>
    </div>
</div>